### Data description
<img src="data_1.png">
<img src="data_2.png">
<img src="data_3.png">

In [243]:
import pandas as pd
import numpy as np

In [244]:
#Reading in the data
df = pd.read_csv('./data/train.csv')

#observing it
print(len(df))
df.head()

891

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [245]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [246]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

- missing values for Age, Cabin, Embarked

### Feature engineering

In [247]:
#Travelling alone or with family? 
df['with_fam'] = ((df.Parch != 0) | (df.SibSp != 0)).astype(int) #1 and 0 values

In [248]:
df.Pclass.value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [249]:
#Extracting name titles from Names

#Looking at few names
print(df.Name.head())

#Function to extract title from name
def get_title(name):
    try:
        return name.split('.')[0].split(', ')[1]
    except e:
        print(e)
        
df['name_titles'] = df.Name.apply(get_title)

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object

In [250]:
df.name_titles.value_counts()

Mr              517
Miss            182
Mrs             125
Master           40
Dr                7
Rev               6
Mlle              2
Major             2
Col               2
Don               1
the Countess      1
Lady              1
Sir               1
Jonkheer          1
Mme               1
Ms                1
Capt              1
Name: name_titles, dtype: int64

In [251]:
name_titles = df.name_titles.value_counts().index #all titles appearing in the names

In [252]:
#Putting the name titles into categories 
# Mr, Mrs, Miss, Master, Royalty, Officer
royalty_list = ['Don', 'Dona', 'Jonkheer', 'Sir', 'the Countess', 'Lady']
officer_list = ['Major', 'Dr', 'Rev', 'Col', 'Capt', ]
miss_list = ['Mlle', 'Ms', 'Miss', 'Mme']

In [253]:
def get_title_category(title):
    if(title in royalty_list):
        return 'royalty'
    elif(title in officer_list):
        return 'officer'
    elif(title in miss_list):
        return 'miss'
    else:
        return title.lower()

df['name_title_category'] = df.name_titles.apply(get_title_category)

In [254]:
#Handling age missing values 
def findAge(title):
    return df.Age[df.name_title_category == title].mean()


#Missing ages taken care of 
df.loc[df.Age.isnull(), 'Age'] = df.name_title_category[df.Age.isnull()].apply(findAge)

### Feature selection and basic model building

In [255]:
#Importing necessary libraries
from sklearn.ensemble import RandomForestClassifier

In [256]:
from sklearn import preprocessing
le = preprocessing.LabelEncoder()
le.fit(df.name_title_category)

#Creating a new category under sex called child if age< 16
df.loc[df.Age<16, 'Sex'] = 'child'
print(df.Sex.value_counts())

df['name_title_category_numerical'] = le.transform(df.name_title_category)
le.fit(df.Sex)
df['sex_category_numerical'] = le.transform(df.Sex)

male      533
female    271
child      87
Name: Sex, dtype: int64

In [257]:
clf = RandomForestClassifier()

features_columns = ['with_fam', 'Fare', 'name_title_category_numerical', 'sex_category_numerical', 'Pclass']
clf.fit(df[features_columns], df.Survived)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
            max_depth=None, max_features='auto', max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, n_estimators=10, n_jobs=1,
            oob_score=False, random_state=None, verbose=0,
            warm_start=False)

In [258]:
df = pd.read_csv('./data/test.csv')

In [259]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [260]:
#Travelling alone or with family? 
df['with_fam'] = ((df.Parch != 0) | (df.SibSp != 0)).astype(int) #1 and 0 values



df['name_titles'] = df.Name.apply(get_title)


df['name_title_category'] = df.name_titles.apply(get_title_category)
le.fit(df.name_title_category)
df['name_title_category_numerical'] = le.transform(df.name_title_category)

#Missing ages taken care of 
df.loc[df.Age.isnull(), 'Age'] = df.name_title_category[df.Age.isnull()].apply(findAge)

#Creating a new category under sex called child if age< 16
df.loc[df.Age<16, 'Sex'] = 'child'
le.fit(df.Sex)
df['sex_category_numerical'] = le.transform(df.Sex)

In [261]:
df[features_columns].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 5 columns):
with_fam                         418 non-null int32
Fare                             417 non-null float64
name_title_category_numerical    418 non-null int64
sex_category_numerical           418 non-null int64
Pclass                           418 non-null int64
dtypes: float64(1), int32(1), int64(3)
memory usage: 14.8 KB

In [262]:
df.loc[df.Fare.isna(), 'Fare'] = 0

In [263]:
sum(df.Age.isna())

0

In [264]:
pred = clf.predict(df[features_columns])
submission = pd.DataFrame({'PassengerId' : df.PassengerId,
                            'Survived' : pred})

submission.to_csv('11febtrial_1', index= False)

In [265]:
#Kaggle score : 0.78468